Comment.create!([
  {
    user_id: 2,
    post_id: 1,
    comment: "郵便為替証書は会計上は現金として扱うことになります。
              \n\n 現金勘定で処理されるものは、通過と通貨代用証券が含まれる。通貨代用証券とは換金性が高い証券で実質上、通貨と同様の役割を果たすものを言う。
              \n 例えば以下のものが含まれる。
              \n\n 郵便為替証書
              \n 他社振出の当座小切手
              \n 振替貯金払出証書
              \n 期限到来後公社債利札
              \n 株主配当金領収書"
  },
  {
    user_id: 1,
    post_id: 1,
    comment: "回答ありがとうございました!"
  },
  {
    user_id: 4,
    post_id: 2,
    comment: "販売以外の理由による商品の払出原価は売上原価を構成しません。
              \n 費用収益対応の原則により、期間利益額を算出する際に期間収益と期間費用の金額的な対応関係が成立するように、当期の発生費用額を当期の収益額に対応する部分と次期以降の収益額に対応する部分とに区分することを要請されています。
              \n \n 今回の場合、決算仕分けにおいて借方[見本費/宣伝広告費]、貸方[仕入]で処理するのが一般的でしょう。
              \n \n 損益計算書上の売上原価項目で見本品として払い出した金額を[他勘定振替高]勘定として振り返え、販管費項目に[見本費]勘定をたてる必要があります。"
  },
  {
    user_id: 5,
    post_id: 2,
    comment: "勉強になりました。また宜しくお願い致します。"
  },
  {
    user_id: 1,
    post_id: 3,
    comment: "ありがとうございます。"
  },
  {
      user_id: 3,
      post_id: 3,
      comment: "見落としていたので助かります。"
  },
  {
    user_id: 2,
    post_id: 4,
    comment: "ビル管理会社等が、水道光熱費、管理人人件費、清掃費等を共益費等と称して各テナントから毎月一定額で領収し、その金額の中からそれぞれの経費を支払う方法をとっている場合には、ビル管理会社等が領収する共益費等は課税の対象となります。
              \n\n また、水道光熱費等の費用がメーター等によりもともと各テナントごとに区分されており、かつ、ビル管理会社等がテナント等から集金した金銭を預り金として処理し、ビル管理会社等は本来テナント等が支払うべき金銭を預かって電力会社等に支払うにすぎないと認められる場合には、当該預り金はビル管理会社等の課税売上げには該当しません。
              "
  },
  {
    user_id: 4,
    post_id: 5,
    comment: "
              ①信販会社が加盟店から譲り受ける債権の額（100）と加盟店への支払額（90）との差額（10）は、消費税法施行令第10条第3項第8号に該当し、非課税となります。
              \n ②消費者が信販会社に支払う手数料は、包括信用購入あっせん又は個別信用購入あっせんに係る手数料又は賦払金のうち利子に相当する額であり、非課税となります（令103九、十）。
            "
  },
  {
    user_id: 1,
    post_id: 5,
    comment: "どちらも非課税なのですね。勉強になります!",
  },
])
